import jetbrains.buildServer.configs.kotlin.*
import jetbrains.buildServer.configs.kotlin.projectFeatures.*

/*
 * ============================================================================
 * TeamCity Kotlin DSL
 * ============================================================================
 *
 * Корневой файл настроек проекта.
 *
 * Загружается TeamCity автоматически при включении:
 *
 * Administration → Versioned Settings
 *
 * Здесь описываются:
 *   - версия DSL;
 *   - корневой проект;
 *   - подключаемые VCS Root;
 *   - build configurations;
 *   - параметры проекта;
 *   - project features.
 *
 * Все изменения в этом файле автоматически применяются TeamCity
 * после коммита в репозиторий.
 *
 * ============================================================================
 */

version = "2026.1.1"

/*
 * ============================================================================
 * Root Project
 * ============================================================================
 */

project {

    /*
     * ------------------------------------------------------------------------
     * Подключение текущего Git-репозитория.
     * ------------------------------------------------------------------------
     *
     * DslContext.settingsRoot автоматически создаётся TeamCity
     * и указывает на репозиторий, в котором лежит каталог .teamcity
     */

    vcsRoot(DslContext.settingsRoot)

    /*
     * ------------------------------------------------------------------------
     * Параметры проекта
     * ------------------------------------------------------------------------
     *
     * Доступны во всех build configurations.
     *
     * Секретные значения рекомендуется хранить:
     *
     * Store secure values outside VCS
     *
     * чтобы они не попадали в Git.
     */

    params {

        /*
         * URL Nexus Repository Manager
         */
        param(
            "env.NEXUS_URL",
            "http://%nexus_url%:8081"
        )

        /*
         * Имя пользователя Nexus
         */
        param(
            "env.NEXUS_USER",
            "%nexus.user%"
        )

        /*
         * Пароль Nexus
         */
        password(
            "env.NEXUS_PASSWORD",
            "%nexus.password%"
        )
    }

    /*
     * ------------------------------------------------------------------------
     * Build Configurations
     * ------------------------------------------------------------------------
     */

    buildType(Build)

    /*
     * ------------------------------------------------------------------------
     * Project Features
     * ------------------------------------------------------------------------
     */

    features {

        /*
         * Отображение статуса сборок в интерфейсе TeamCity
         */

        buildReportTab {
            title = "Build Report"
            startPage = "index.html"
        }
    }
}
